tests/fixtures/invoice_index.json

{
  "invoices": [
    {
      "lago_id": "b7ab2926-1de8-4428-9bcd-779314ac1111",
      "sequential_id": 15,
      "number": "LAG-1234-001-002",
      "from_date": "2022-06-02",
      "to_date": "2022-06-02",
      "charges_from_date": "2022-06-02",
      "issuing_date": "2022-06-02",
      "invoice_type": "type1",
      "status": "finalized",
      "payment_status": "failed",
      "amount_cents": 100,
      "amount_currency": "EUR",
      "vat_amount_cents": 20,
      "vat_amount_currency": "EUR",
      "total_amount_cents": 120,
      "total_amount_currency": "EUR"
    },
    {
      "lago_id": "b7ab2926-1de8-4428-9bcd-779314ac1222",
      "sequential_id": 16,
      "number": "LAG-1234-001-003",
      "from_date": "2022-06-02",
      "to_date": "2022-06-02",
      "charges_from_date": "2022-06-02",
      "issuing_date": "2022-06-02",
      "invoice_type": "type1",
      "status": "finalized",
      "payment_status": "failed",
      "amount_cents": 200,
      "amount_currency": "EUR",
      "vat_amount_cents": 40,
      "vat_amount_currency": "EUR",
      "total_amount_cents": 240,
      "total_amount_currency": "EUR"
    }
  ],
  "meta": {
    "current_page": 1,
    "next_page": 2,
    "prev_page": null,
    "total_pages": 8,
    "total_count": 73
  }
}
