tests/fixtures/invoice.json

{
  "invoice": {
    "lago_id": "5eb02857-a71e-4ea2-bcf9-57d3a41bc6ba",
    "sequential_id": 15,
    "number": "LAG-1234-001-002",
    "issuing_date": "2022-06-02",
    "invoice_type": "type1",
    "version_number": 2,
    "status": "finalized",
    "payment_status": "failed",
    "currency": "EUR",
    "fees_amount_cents": 100,
    "vat_amount_cents": 20,
    "coupons_amount_cents": 0,
    "credit_notes_amount_cents": 0,
    "sub_total_vat_excluded_amount_cents": 100,
    "sub_total_vat_included_amount_cents": 120,
    "prepaid_credit_amount_cents": 0,
    "total_amount_cents": 120,
    "legacy": false,
    "amount_cents": 100,
    "credit_amount_cents": 0,
    "amount_currency": "EUR",
    "credit_amount_currency": "EUR",
    "vat_amount_currency": "EUR",
    "total_amount_currency": "EUR",
    "metadata": [
      {
        "key": "key",
        "value": "value",
        "display_in_invoice": true
      }
    ],
    "customer": {
      "lago_id": "99a6094e-199b-4101-896a-54e927ce7bd7",
      "external_id": "5eb02857-a71e-4ea2-bcf9-57d3a41bc6ba",
      "address_line1": "5230 Penfield Ave",
      "address_line2": null,
      "city": "Woodland Hills",
      "country": "US",
      "created_at": "2022-04-29T08:59:51Z",
      "email": "dinesh@piedpiper.test",
      "legal_name": "Coleman-Blair",
      "legal_number": "49-008-2965",
      "logo_url": "http://hooli.com/logo.png",
      "name": "Gavin Belson",
      "phone": "1-171-883-3711 x245",
      "state": "CA",
      "url": "http://hooli.com",
      "vat_rate": 12.5,
      "zipcode": "91364",
      "currency": "EUR",
      "timezone": "Europe/Paris",
      "applicable_timezone": "Europe/Paris",
      "billing_configuration": {
        "payment_provider": "stripe",
        "provider_customer_id": "cus_12345"
      }
    },
    "subscriptions": [
      {
        "lago_id": "b7ab2926-1de8-4428-9bcd-779314ac129b",
        "lago_customer_id": "99a6094e-199b-4101-896a-54e927ce7bd7",
        "external_customer_id": "5eb02857-a71e-4ea2-bcf9-57d3a41bc6ba",
        "canceled_at": "2022-04-29T08:59:51Z",
        "created_at": "2022-04-29T08:59:51Z",
        "plan_code": "eartha lynch",
        "started_at": "2022-04-29T08:59:51Z",
        "status": "active",
        "billing_time": "anniversary",
        "terminated_at": null,
        "subscription_date": "2022-04-29",
        "previous_plan_code": null,
        "next_plan_code": null,
        "downgrade_plan_date": null
      }
    ],
    "fees": [
      {
        "lago_id": "5eb02857-a71e-4ea2-bcf9-57d3a41bc6ba",
        "item": {
          "type": "charge",
          "code": "seats",
          "name": "User Seats"
        },
        "amount_cents": 100,
        "amount_currency": "EUR",
        "vat_amount_cents": 20,
        "vat_amount_currency": "EUR",
        "total_amount_cents": 120,
        "total_amount_currency": "EUR",
        "units": 12.6,
        "events_count": 4
      }
    ],
    "credits": [
      {
        "amount_cents": 20,
        "amount_currency": "EUR",
        "item": {
          "type": "coupon",
          "code": "free_beer",
          "name": "Free Beer"
        }
      }
    ]
  }
}
